% ----------------------------------------------------
% TP - PDA - Groupe : Brandon Hornbeck, Reynault Sies
% ----------------------------------------------------

% ----------------------------------------------------
% Implantation de la méthode pour le calcul propositionnel
% ----------------------------------------------------



% ----------------------------------------------------
% Implantation de la méthode pour le calcul des prédicats du premier ordre.
% ----------------------------------------------------



% ----------------------------------------------------
% Prédicats liés à l'éxécution de l'une des deux méthodes
% ----------------------------------------------------

